000100201215             PGM
000200201215             ADDLIBLE   LIB(GGUILLENB) POSITION(*LAST)
000301201215             CALL PGM(REPORTE3)
000400201215             RMVLIBLE   LIB(GGUILLENB)
000500201215             ENDPGM
