000100201217d Add             PR            15s 2
000101201217d num1                          15s 2
000102201217d num2                          15s 2
000103201217
000104201217d Substract       PR            15s 2
000105201217d num1                          15s 2
000106201217d num2                          15s 2
000107201217
000108201217d Multiply        PR            15s 2
000109201217d num1                          15s 2
000110201217d num2                          15s 2
000111201217
000112201217d Divide          PR            15s 2
000113201217d num1                          15s 2
000114201217d num2                          15s 2
